Revit 2026 API

# CompoundStructureIsValidSampleHeight Method

---

Is the specified height a valid sample height for this compound structure?

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidSampleHeight(
	double height
)
```
```vb
Public Function IsValidSampleHeight (
	height As Double
) As Boolean
```
```cpp
public:
bool IsValidSampleHeight(
	double height
)
```
```fsharp
member IsValidSampleHeight :
        height : float -> bool
```

#### Parameters

height Double

#### Return Value

Boolean

The sample height cannot be less than the value of MinimumSampleHeight.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace